Show / Hide Table of Contents
Class BIMPluginHosting
Inheritance
System.Object
BIMPluginHosting
Implements
IBIMPluginHosting
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class BIMPluginHosting : IBIMPluginHosting, IDisposable
Constructors
Improve this Doc   View Source
BIMPluginHosting(IBIMPluginFactory, IPluginLogger, String, String)
Declaration
public BIMPluginHosting(IBIMPluginFactory factory, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent", string pluginUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}")
Parameters
 Type |  Name |  Description
 IBIMPluginFactory |  factory
 IPluginLogger |  logger
 System.String |  eventName
 System.String |  pluginUrlFormat
Properties
Improve this Doc   View Source
HostingTask
Declaration
public Task HostingTask { get; set; }
Property Value
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
Service
Declaration
public IApplicationBIM Service { get; }
Property Value
 Type |  Description
 IApplicationBIM
Methods
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Improve this Doc   View Source
NotifyAppStatusChanged(AppStatus)
Declaration
protected void NotifyAppStatusChanged(AppStatus newStatus)
Parameters
 Type |  Name |  Description
 AppStatus |  newStatus
Improve this Doc   View Source
RunAsync(String, String)
Declaration
public Task RunAsync(string id, string workingDirectory)
Parameters
 Type |  Name |  Description
 System.String |  id
 System.String |  workingDirectory
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
Stop()
Declaration
public void Stop()
Events
Improve this Doc   View Source
AppStatusChanged
Declaration
public event ISEventHandler AppStatusChanged
Event Type
 Type |  Description
 ISEventHandler
Implements
 IBIMPluginHosting
 System.IDisposable
 Improve this Doc
 View Source